# -*- coding: utf-8 -*-
"""
Created on Thu Jul  1 10:05:37 2021

@author: Administrator
"""

objfiles = "C:/Users/Administrator/Desktop/xxx.txt"
#运行目录下的相对路径'xxx.txt'
#相对路径'/xxx/xxx.txt'
#在此确定变量绝对路径

try:
    f =open()    
#例句：C:/Users/Administrator/Desktop/xxx.txt
    f.close()
except IOError:
    print ("File is not accessible.")
#判断文件是否存在！！！

f=open(objfiles,'a+')
print ("The text file contains: : ", f.read())
#显示也可以添加变量，例句：filecontent = f.read()

f.write()
#保存txt文本"this is my file" 
f.close()

# =============================================================================
# 读写方式	可否读写	若文件不存在	写入方式
# w	        写入	      创建	覆盖写入
# w+	    读取+写入	  创建	覆盖写入
# a	        写入	      创建	附加写入
# a+	    读取+写入	  创建	附加写入
# r	        读取	      报错	不可写入
# r+	    读取+写入	  报错	覆盖写入
# =============================================================================
# =============================================================================
# 
#  seek()函数
# seek() 函数用于将文件指针移动至指定位置，该函数的语法格式如下：
# 
# file.seek(offset[, whence])
# 其中，各个参数的含义如下：
# 
#     file：表示文件对象；
#     whence：作为可选参数，用于指定文件指针要放置的位置，该参数的参数值有 3 个选择：0 代表文件头（默认值）、1 代表当前位置、2 代表文件尾。
#     offset：表示相对于 whence 位置文件指针的偏移量，正数表示向后偏移，负数表示向前偏移。例如，当whence == 0 &&offset == 3（即 seek(3,0) ），表示文件指针移动至距离文件开头处 3 个字符的位置；当whence == 1 &&offset == 5（即 seek(5,1) ），表示文件指针向后移动，移动至距离当前位置 5 个字符处。
# 
#     注意，当 offset 值非 0 时，Python 要求文件必须要以二进制格式打开，否则会抛出 io.UnsupportedOperation 错误。
# 
# 
# =============================================================================
# =============================================================================
#     f = open('a.txt', 'rb')
#     # 判断文件指针的位置
#     print(f.tell())
#     # 读取一个字节，文件指针自动后移1个数据
#     print(f.read(1))
#     print(f.tell())
#     # 将文件指针从文件开头，向后移动到 5 个字符的位置
#     f.seek(5)
#     print(f.tell())
#     print(f.read(1))
#     # 将文件指针从当前位置，向后移动到 5 个字符的位置
#     f.seek(5, 1)
#     print(f.tell())
#     print(f.read(1))
#     # 将文件指针从文件结尾，向前移动到距离 2 个字符的位置
#     f.seek(-1, 2)
#     print(f.tell())
#     print(f.read(1))
# =============================================================================
